config/cf/Catalogs/ВидыМестХранения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>ВидыМестХранения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмеетСетевыеНастройки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НавСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/cf/Catalogs/ВидыМестХранения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет виды мест хранения по умолчанию.
//
// Параметры:
//	Нет
//
Процедура ЗаполнитьВидыМестХраненияПриПервоначальномЗаполнении() Экспорт
	
	// Описываем стуктуру.
	ТЗ = Новый ТаблицаЗначений;
	ТЗ.Колонки.Добавить("Объект");
	ТЗ.Колонки.Добавить("Наименование");
	ТЗ.Колонки.Добавить("ИмеетСетевыеНастройки");
	ТЗ.Колонки.Добавить("Картинка");
	
	ВД = Справочники.ВидыМестХранения;
	
	// Заполняем реквизитами.
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.РабочееМесто,				НСтр("ru = 'Рабочее место'"), Истина		, БиблиотекаКартинок.вмхРабочееМесто);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Склад,						НСтр("ru = 'Склад'"), 						, БиблиотекаКартинок.вмхСклад);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Шкаф,						НСтр("ru = 'Шкаф'"), 						, БиблиотекаКартинок.вмхШкаф);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.СкладРасходныхМатериалов,	НСтр("ru = 'Склад расходных материалов'"), 	, БиблиотекаКартинок.вмхСкладРасходныхМатериалов);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.Полка,						НСтр("ru = 'Полка'"), 						, БиблиотекаКартинок.вмхПолка);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.СкладСписанногоОборудования,	НСтр("ru = 'Склад списанного оборудования'"),, БиблиотекаКартинок.вмхСкладСписанногоОборудования);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.СкладРемонта,				НСтр("ru = 'Склад ремонта'"), 				, БиблиотекаКартинок.вмхСкладРемонта);
	ДобавитьВТаблицуЗначений(ТЗ,	ВД.СерверныйШкаф,				НСтр("ru = 'Серверный шкаф'"), 				, БиблиотекаКартинок.вмхСерверныйШкаф);
	
	// Записываем.
	Для Каждого Строки Из ТЗ Цикл
		Объект = Строки.Объект.ПолучитьОбъект();
		ЗаполнитьЗначенияСвойств(Объект, Строки);
		Объект.Картинка = Новый ХранилищеЗначения(Строки.Картинка.Получить());
		Объект.Записать();
	КонецЦикла;

	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьВТаблицуЗначений(ТЗ, Объект, Наименование, ИмеетСетевыеНастройки = Ложь, Картинка = Неопределено)
	
	НоваяСтрока = ТЗ.Добавить();
	НоваяСтрока.Объект		 				= Объект;
	НоваяСтрока.Наименование 				= Наименование;
	НоваяСтрока.ИмеетСетевыеНастройки		= ИмеетСетевыеНастройки;
	Если Картинка <> Неопределено Тогда
		НоваяСтрока.Картинка 				= Новый ХранилищеЗначения(Картинка);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
